_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_8 (Embedding)      (None, 55, 300)           640800    
_________________________________________________________________
lstm_15 (LSTM)               (None, 55, 128)           219648    
_________________________________________________________________
lstm_16 (LSTM)               (None, 55, 64)            49408     
_________________________________________________________________
attention_with_context_4 (At (None, 64)                4224      
_________________________________________________________________
dense_21 (Dense)             (None, 128)               8320      
_________________________________________________________________
dropout_11 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_22 (Dense)             (None, 64)                8256      
_________________________________________________________________
dropout_12 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_23 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_24 (Dense)             (None, 5)                 165       
=================================================================
Total params: 932,901
Trainable params: 292,101
Non-trainable params: 640,800
_________________________________________________________________